OpenFOAM/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    front
    {
        type            empty;
        physicalType    patch;
        nFaces          39497;
        startFace       58942;
    }
    back
    {
        type            empty;
        physicalType    patch;
        nFaces          39497;
        startFace       98439;
    }
    exit
    {
        type            patch;
        physicalType    patch;
        nFaces          50;
        startFace       137936;
    }
    bottom
    {
        type            patch;
        physicalType    patch;
        nFaces          50;
        startFace       137986;
    }
    inlet
    {
        type            patch;
        physicalType    patch;
        nFaces          50;
        startFace       138036;
    }
    top
    {
        type            patch;
        physicalType    patch;
        nFaces          50;
        startFace       138086;
    }
    aerofoil
    {
        type            wall;
        physicalType    patch;
        nFaces          407;
        startFace       138136;
    }
)

// ************************************************************************* //
