OpenFOAM/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    Version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      tranportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

/* tranportModel  Newtonian; */
viscosityModel constant;

/* rho     [1 -3 0 0 0 0 0] 1; */
/* nu      [0 -2 -1 0 0 0 0] 1.56e-5; */

nu      1.56e-5;
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //