OpenFOAM/0/wallShearStress
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "0";
    object      wallShearStress;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
    exit
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    bottom
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    inlet
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    top
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    aerofoil
    {
        type            calculated;
        value           nonuniform List<vector> 
407
(
(-0.262173 -0.00273744 1.45035e-23)
(-0.226481 -0.00205756 -0)
(-0.21587 -0.00812098 -0)
(-0.232454 -0.00106635 -0)
(-0.229478 0.0079544 0)
(-0.208454 0.00776856 -1.65599e-22)
(-0.183355 -8.19312e-05 0)
(-0.236515 0.00242238 1.28342e-23)
...
)
;
    }
}


// ************************************************************************* //
