OpenFOAM/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         steadyState;
}

gradSchemes
{
    default         cellLimited Gauss linear 1 ;
    // default         cellLimited Gauss linear 1;
    // default         cellLimited leastSquares 1;
    // grad(p)         cellLimited Gauss linear 1;
    // grad(U)         cellLimited Gauss linear 1;/
}

divSchemes
{
    default         none;
    div(phi,U)         bounded Gauss linearUpwind grad(U);
    // div(phi,nuTilda)    bounded Gauss linearUpwind grad(nuTilda);
    // div(phi,k)          bounded Gauss limitedLinear 1;
    div(phi,k)          bounded Gauss linearUpwind grad(k);
    div(phid,p)         Gauss linearUpwind limited;
    // div(phi,omega)      bounded Gauss limitedLinear 1;
    div(phi,omega)      bounded Gauss linearUpwind grad(omega);
    div((nuEff*dev2(T(grad(U))))) Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected;
}

wallDist
{
    method meshWave;
}


// ************************************************************************* //