OpenFOAM/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          GAMG;
        tolerance       1e-04;
        relTol          0.01;
        smoother        GaussSeidel;
    }

    U
    {
        solver          smoothSolver;
        smoother        GaussSeidel;
        nSweeps         2;
        tolerance       1e-05;
        relTol          0.01;
    }

    // nuTilda
    // {
    //     solver          smoothSolver;
    //     smoother        GaussSeidel;
    //     nSweeps         2;
    //     tolerance       1e-05;
    //     relTol          0.01;
    // }

    k
    {
        solver          smoothSolver;
        smoother        GaussSeidel;
        tolerance       1e-5;
        relTol          0.01;
        nSweeps         1;
    }

    omega
    {
        solver          smoothSolver;
        smoother        GaussSeidel;
        tolerance       1e-5;
        relTol          0.01;
        nSweeps         1;
    }

}

SIMPLE
{
    // nNonOrthogonalCorrectors 0;
    // pRefCell        0;
    // pRefValue       0;

    nNonOrthogonalCorrectors 1;
    pRefCell        0;
    pRefValue       1e5;

    residualControl
    {
        p               1e-3;
        U               1e-4;
        omega           1e-4;
        k               1e-4;
        
    }
}

relaxationFactors
{
    fields
    {
        default         0;
        p               0.4;
    }
    equations
    {
        default         0;
        U               0.4;
        p               0.4;
        "omega|k"     0.4;
    }
}




// ************************************************************************* //