OpenFOAM/system/boundaryProbes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Writes out values of fields at a specified list of points, interpolated to
    specified boundary patches.

\*---------------------------------------------------------------------------*/
fields  (p);
#include "system/foamtest"
points  $pts;

interpolationScheme  cellPoint;
setFormat  raw;
maxDistance  0.1;
// executeControl  timeStep;
// writeControl    timeStep;
// writeInterval   100;
// stopAt          endTime;

patches  ("aerofoil");



#includeEtc "caseDicts/postProcessing/probes/boundaryProbes.cfg"

// ************************************************************************* //
