OpenFOAM/system/foamtest
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     |
    \\  /    A nd           | Web:      www.OpenFOAM.org
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Writes out values of fields at a cloud of points, interpolated to
    specified boundary patches.

\*---------------------------------------------------------------------------*/

pts
(
(1.0 0.00126 0.05)
(0.9994161 0.0013419 0.05)
(0.9976658 0.001587 0.05)
(0.9947532 0.0019938 0.05)
(0.990685 0.0025595 0.05)
(0.9854709 0.0032804 0.05)
(0.9791229 0.0041519 0.05)
(0.9716559 0.051685 0.05)
(0.9630873 0.0063238 0.05)
(0.9534372 0.0076108 0.05)
(0.942728 0.0090217 0.05)
(0.9309849 0.0105485 0.05)
(0.9182351 0.0121823 0.05)
(0.9045085 0.0139143 0.05)
(0.8898372 0.0157351 0.05)
(0.8742554 0.0176353 0.05)
(0.8577995 0.0196051 0.05)
(0.8405079 0.0216347 0.05)
(0.8224211 0.0237142 0.05)
(0.8035813 0.0258337 0.05)
(0.7840324 0.0279828 0.05)
(0.7638202 0.0301515 0.05)
(0.7429917 0.0323294 0.05)
(0.7215958 0.0345058 0.05)
(0.6996823 0.03667 0.05)
(0.6773025 0.0388109 0.05)
(0.6545085 0.0409174 0.05)
(0.6313537 0.0429778 0.05)
(0.6078921 0.0449802 0.05)
(0.5841786 0.0469124 0.05)
(0.5602683 0.0487619 0.05)
(0.5362174 0.0505161 0.05)
(0.5120819 0.052162 0.05)
(0.4879181 0.0536866 0.05)
(0.4637826 0.0550769 0.05)
(0.4397317 0.05632 0.05)
(0.4158215 0.0574033 0.05)
(0.3921079 0.0583145 0.05)
(0.3686463 0.0590419 0.05)
(0.3454915 0.0595747 0.05)
(0.3226976 0.0599028 0.05)
(0.3003177 0.0600172 0.05)
(0.2784042 0.0599102 0.05)
(0.2570083 0.0595755 0.05)
(0.2361799 0.0590081 0.05)
(0.2159676 0.0582048 0.05)
(0.1964187 0.057164 0.05)
(0.1775789 0.0558856 0.05)
(0.1594921 0.0543715 0.05)
(0.1422005 0.0526251 0.05)
(0.1257446 0.0506513 0.05)
(0.1101628 0.0484567 0.05)
(0.0954915 0.0460489 0.05)
(0.0817649 0.0434371 0.05)
(0.0690152 0.040631 0.05)
(0.057272 0.0376414 0.05)
(0.0465628 0.0344792 0.05)
(0.0369127 0.0311559 0.05)
(0.0283441 0.0276827 0.05)
(0.0208771 0.0240706 0.05)
(0.0145291 0.02033 0.05)
(0.0093149 0.0164706 0.05)
(0.052468 0.0125011 0.05)
(0.0023342 0.0084289 0.05)
(0.0005839 0.0042603 0.05)
(0.0 0.0 0.05)
(0.0005839 -0.0042603 0.05)
(0.0023342 -0.0084289 0.05)
(0.052468 -0.0125011 0.05)
(0.0093149 -0.0164706 0.05)
(0.0145291 -0.02033 0.05)
(0.0208771 -0.0240706 0.05)
(0.0283441 -0.0276827 0.05)
(0.0369127 -0.0311559 0.05)
(0.0465628 -0.0344792 0.05)
(0.057272 -0.0376414 0.05)
(0.0690152 -0.040631 0.05)
(0.0817649 -0.0434371 0.05)
(0.0954915 -0.0460489 0.05)
(0.1101628 -0.0484567 0.05)
(0.1257446 -0.0506513 0.05)
(0.1422005 -0.0526251 0.05)
(0.1594921 -0.0543715 0.05)
(0.1775789 -0.0558856 0.05)
(0.1964187 -0.057164 0.05)
(0.2159676 -0.0582048 0.05)
(0.2361799 -0.0590081 0.05)
(0.2570083 -0.0595755 0.05)
(0.2784042 -0.0599102 0.05)
(0.3003177 -0.0600172 0.05)
(0.3226976 -0.0599028 0.05)
(0.3454915 -0.0595747 0.05)
(0.3686463 -0.0590419 0.05)
(0.3921079 -0.0583145 0.05)
(0.4158215 -0.0574033 0.05)
(0.4397317 -0.05632 0.05)
(0.4637826 -0.0550769 0.05)
(0.4879181 -0.0536866 0.05)
(0.5120819 -0.052162 0.05)
(0.5362174 -0.0505161 0.05)
(0.5602683 -0.0487619 0.05)
(0.5841786 -0.0469124 0.05)
(0.6078921 -0.0449802 0.05)
(0.6313537 -0.0429778 0.05)
(0.6545085 -0.0409174 0.05)
(0.6773025 -0.0388109 0.05)
(0.6996823 -0.03667 0.05)
(0.7215958 -0.0345058 0.05)
(0.7429917 -0.0323294 0.05)
(0.7638202 -0.0301515 0.05)
(0.7840324 -0.0279828 0.05)
(0.8035813 -0.0258337 0.05)
(0.8224211 -0.0237142 0.05)
(0.8405079 -0.0216347 0.05)
(0.8577995 -0.0196051 0.05)
(0.8742554 -0.0176353 0.05)
(0.8898372 -0.0157351 0.05)
(0.9045085 -0.0139143 0.05)
(0.9182351 -0.0121823 0.05)
(0.9309849 -0.0105485 0.05)
(0.942728 -0.0090217 0.05)
(0.9534372 -0.0076108 0.05)
(0.9630873 -0.0063238 0.05)
(0.9716559 -0.051685 0.05)
(0.9791229 -0.0041519 0.05)
(0.9854709 -0.0032804 0.05)
(0.990685 -0.0025595 0.05)
(0.9947532 -0.0019938 0.05)
(0.9976658 -0.001587 0.05)
(0.9994161 -0.0013419 0.05)
(1.0 -0.00126 0.05)
);

// ************************************************************************* //