OpenFOAM/system/internalCloud
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     |
    \\  /    A nd           | Web:      www.OpenFOAM.org
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Writes out values of fields interpolated to a specified cloud of points.

\*---------------------------------------------------------------------------*/

fields (p U);
points
(
(-0.5 -1.0 0.5)
(-0.484375 -1.0 0.5)
(-0.46875 -1.0 0.5)
(-0.453125 -1.0 0.5)
(-0.4375 -1.0 0.5)
(-0.421875 -1.0 0.5)
(-0.40625 -1.0 0.5)
(-0.390625 -1.0 0.5)
(-0.375 -1.0 0.5)
(-0.359375 -1.0 0.5)
(-0.34375 -1.0 0.5)
(-0.328125 -1.0 0.5)
(-0.3125 -1.0 0.5)
(-0.296875 -1.0 0.5)
(-0.28125 -1.0 0.5)
(-0.265625 -1.0 0.5)
(-0.25 -1.0 0.5)
(-0.234375 -1.0 0.5)
(-0.21875 -1.0 0.5)
(-0.203125 -1.0 0.5)
(-0.1875 -1.0 0.5)
(-0.171875 -1.0 0.5)
(-0.15625 -1.0 0.5)
(-0.140625 -1.0 0.5)
(-0.125 -1.0 0.5)
(-0.109375 -1.0 0.5)
(-0.09375 -1.0 0.5)
(-0.078125 -1.0 0.5)
(-0.0625 -1.0 0.5)
(-0.046875 -1.0 0.5)
(-0.03125 -1.0 0.5)
(-0.015625 -1.0 0.5)
(0.0 -1.0 0.5)
(0.015625 -1.0 0.5)
(0.03125 -1.0 0.5)
(0.046875 -1.0 0.5)
(0.0625 -1.0 0.5)
(0.078125 -1.0 0.5)
(0.09375 -1.0 0.5)
(0.109375 -1.0 0.5)
(0.125 -1.0 0.5)
(0.140625 -1.0 0.5)
(0.15625 -1.0 0.5)
(0.171875 -1.0 0.5)
(0.1875 -1.0 0.5)
(0.203125 -1.0 0.5)
(0.21875 -1.0 0.5)
(0.234375 -1.0 0.5)
(0.25 -1.0 0.5)
(0.265625 -1.0 0.5)
(0.28125 -1.0 0.5)
(0.296875 -1.0 0.5)
(0.3125 -1.0 0.5)
(0.328125 -1.0 0.5)
(0.34375 -1.0 0.5)
(0.359375 -1.0 0.5)
(0.375 -1.0 0.5)
(0.390625 -1.0 0.5)
(0.40625 -1.0 0.5)
(0.421875 -1.0 0.5)
(0.4375 -1.0 0.5)
(0.453125 -1.0 0.5)
(0.46875 -1.0 0.5)
(0.484375 -1.0 0.5)
(0.5 -1.0 0.5)
(0.515625 -1.0 0.5)
(0.53125 -1.0 0.5)
(0.546875 -1.0 0.5)
(0.5625 -1.0 0.5)
(0.578125 -1.0 0.5)
(0.59375 -1.0 0.5)
(0.609375 -1.0 0.5)
(0.625 -1.0 0.5)
(0.640625 -1.0 0.5)
(0.65625 -1.0 0.5)
(0.671875 -1.0 0.5)
(0.6875 -1.0 0.5)
(0.703125 -1.0 0.5)
(0.71875 -1.0 0.5)
(0.734375 -1.0 0.5)
(0.75 -1.0 0.5)
(0.765625 -1.0 0.5)
(0.78125 -1.0 0.5)
(0.796875 -1.0 0.5)
(0.8125 -1.0 0.5)
(0.828125 -1.0 0.5)
(0.84375 -1.0 0.5)
(0.859375 -1.0 0.5)
(0.875 -1.0 0.5)
(0.890625 -1.0 0.5)
(0.90625 -1.0 0.5)
(0.921875 -1.0 0.5)
(0.9375 -1.0 0.5)
(0.953125 -1.0 0.5)
(0.96875 -1.0 0.5)
(0.984375 -1.0 0.5)
(1.0 -1.0 0.5)
(1.015625 -1.0 0.5)
(1.03125 -1.0 0.5)
...
);

type            sets;
libs            ("libsampling.so");

interpolationScheme cellPoint;
setFormat	raw;



//executeControl  endTime;
//writeControl    endTime;
//writeInterval   4000;

executeControl  timeStep;
writeControl    timeStep;
writeInterval   100;
stopAt          endTime;

sets
(
    points
    {
        type    points;
        axis    xyz;
        points  $points;
        ordered  1;
    }
);

// ************************************************************************* //